Repository: SanjayTeja01/AI_Project
Catalog: lib/l10n/app_*.arb
Languages: te

# appTitle
source: Campus Guard
te: క్యాంపస్ గార్డ్

source: Welcome back!
te: మళ్లీ స్వాగతం!

# createAccount
source: Create an account
te: ఖాతా సృష్టించండి

source: Username
te: వినియోగదారు పేరు

source: Email
te: ఇమెయిల్

source: Password
te: పాస్వర్డ్

source: Login
te: లాగిన్

source: Sign Up
te: సైన్ అప్

# dontHaveAccount
source: Don't have an account? Sign Up
te: ఖాతా లేదా? సైన్ అప్ చేయండి

# alreadyHaveAccount
source: Already have an account? Login
te: ఇప్పటికే ఖాతా ఉందా? లాగిన్

# pleaseEnterUsername
source: Please enter a username
te: దయచేసి వినియోగదారు పేరు నమోదు చేయండి

# pleaseEnterEmail
source: Please enter an email
te: దయచేసి ఇమెయిల్ నమోదు చేయండి

# pleaseEnterValidEmail
source: Please enter a valid email
te: దయచేసి సరైన ఇమెయిల్ నమోదు చేయండి

# pleaseEnterPassword
source: Please enter a password
te: దయచేసి పాస్వర్డ్ నమోదు చేయండి

# passwordMinLength
source: Password must be at least 6 characters
te: పాస్వర్డ్ కనీసం 6 అక్షరాలుగా ఉండాలి

source: An error occurred
te: దోషం సంభవించింది

# unexpectedError
source: An unexpected error occurred
te: ఊహించని దోషం సంభవించింది

source: Home
te: హోమ్

source: Profile
te: ప్రొఫైల్

source: SOS History
te: SOS చరిత్ర

source: Emergency Contacts
te: అత్యవసర సంప్రదింపులు

source: Terms and Conditions
te: నిబంధనలు మరియు షరతులు

source: Log Out
te: లాగ్ అవుట్

# logOutConfirm
source: Are you sure you want to log out?
te: మీరు నిజంగా లాగ్ అవుట్ చేయాలనుకుంటున్నారా?

source: Cancel
te: రద్దు చేయి

source: User
te: వినియోగదారు

source: Stop SOS
te: SOS ఆపు

source: SOS Alert Ended
te: SOS హెచ్చరిక ముగిసింది

source: View Location
te: స్థానాన్ని వీక్షించండి

source: Delete
te: తొలగించు

source: Mobile Number
te: మొబైల్ నంబర్

source: Save
te: సేవ్

source: Edit
te: సవరించు

source: Name
te: పేరు

source: Phone
te: ఫోన్

source: Add Contact
te: సంప్రదింపు జోడించు

# noContacts
source: No contacts added yet
te: ఇంకా సంప్రదింపులు జోడించబడలేదు

# acceptTerms
source: I accept the Terms and Conditions
te: నేను నిబంధనలు మరియు షరతులను అంగీకరిస్తున్నాను

# pleaseAcceptTerms
source: Please accept the Terms and Conditions
te: దయచేసి నిబంధనలు మరియు షరతులను అంగీకరించండి

source: Language
te: భాష

# locationServicesDisabled
source: Location services are disabled. Please enable them.
te: స్థాన సేవలు నిలిపివేయబడ్డాయి. దయచేసి వాటిని ప్రారంభించండి.

source: Location permission denied
te: స్థాన అనుమతి తిరస్కరించబడింది

# locationPermissionPermanentlyDenied
source: Location permissions are permanently denied
te: స్థాన అనుమతులు శాశ్వతంగా తిరస్కరించబడ్డాయి

# noEmergencyContacts
source: No emergency contacts found. Please add contacts first.
te: అత్యవసర సంప్రదింపులు కనుగొనబడలేదు. దయచేసి మొదట సంప్రదింపులను జోడించండి.

# profileUpdated
source: Profile updated successfully
te: ప్రొఫైల్ విజయవంతంగా నవీకరించబడింది

# profileUpdateFailed
source: Failed to update profile
te: ప్రొఫైల్ నవీకరించడంలో విఫలమైంది

# fillAllFields
source: Please fill in all fields
te: దయచేసి అన్ని ఫీల్డ్‌లను పూరించండి

# contactAdded
source: Contact added successfully
te: సంప్రదింపు విజయవంతంగా జోడించబడింది

# contactAddFailed
source: Failed to add contact
te: సంప్రదింపు జోడించడంలో విఫలమైంది

source: Delete Contact
te: సంప్రదింపును తొలగించు

# deleteContactConfirm
source: Are you sure you want to delete this contact?
te: మీరు ఖచ్చితంగా ఈ సంప్రదింపును తొలగించాలనుకుంటున్నారా?

source: Contact deleted
te: సంప్రదింపు తొలగించబడింది

source: Delete SOS Event
te: SOS ఈవెంట్‌ను తొలగించు

# deleteSosEventConfirm
source: Are you sure you want to delete this SOS event?
te: మీరు ఖచ్చితంగా ఈ SOS ఈవెంట్‌ను తొలగించాలనుకుంటున్నారా?

# cannotDeleteActiveSos
source: Cannot delete an active SOS event. Please stop it first.
te: సక్రియ SOS ఈవెంట్‌ను తొలగించలేరు. దయచేసి మొదట దాన్ని ఆపండి.

source: SOS event deleted
te: SOS ఈవెంట్ తొలగించబడింది

# sosEventDeleteFailed
source: Failed to delete SOS event
te: SOS ఈవెంట్ తొలగించడంలో విఫలమైంది

source: No SOS history
te: SOS చరిత్ర లేదు

# stopSosConfirm
source: Are you sure you want to stop the SOS alert?
te: మీరు ఖచ్చితంగా SOS హెచ్చరికను ఆపాలనుకుంటున్నారా?

source: Chitti Voice Assistant
te: చిత్తి వాయిస్ అసిస్టెంట్

source: Chat with Chitti
te: చిత్తితో చాట్ చేయండి

# typeMessageOrVoice
source: Type a message or use voice
te: సందేశాన్ని టైప్ చేయండి లేదా వాయిస్ ఉపయోగించండి

source: Type your message...
te: మీ సందేశాన్ని టైప్ చేయండి...

# chittiThinking
source: Chitti is thinking...
te: చిత్తి ఆలోచిస్తోంది...

source: New Chat
te: కొత్త చాట్
